{"meta":{"title":"ジョの個人サイト","subtitle":null,"description":"Jo记录自己生活与学习的地方","author":"Jo-Kaan","url":"https://babycarb.github.io","root":"/"},"pages":[{"title":"404","text":"","path":"404/index.html","date":"09-25","excerpt":""},{"title":"about","text":"關於我想在這裏説一下，我建立這個私人博客的想法 我是從事IT工作的，一開始我認爲自己是個程序員，但是後來在工作當中慢慢發現，我也許不是一個程序員，這句話或者聽起來很奇怪。因爲我的第一份工作就是在日本從事軟件開發，再來日本之前我和大多數人一樣，我根本沒有意識到日本的程序開發與中國的程序開發的區別。和任何一個初入崗位的年輕人一樣，我都是想精進自己的能力，在工作上更有作爲。但是在我的工作與學習當中，我慢慢發現出了問題。工作的方向似乎與學習的方向開始有些偏差。不敢説是完全不一樣，但差別還是挺大的。後來自己也看了些資料，與朋友前輩對國内與日本的IT行業都進行了一些瞭解。 我自己的入行初衷是，成長成一個可以獨立開發，完全可以自己接小單，接一些私活的程序員。往上面我也不想太多，沒有那種大志氣去寫一個新的開源框架什麽的。我也很有自知之明，我十分斷定自己沒有那種天賦，那種事情交給跟適合做的人去做就好了。儘管我認爲自己的入行初衷並不算高，但是我卻是在工作中與之漸行漸遠。儘管錢拿的不算很低，但是我還是很害怕。 所以我搭建這個博客，在這裏記錄一些雜文，一些游記，一些知識點，不僅是讓自己成爲一個自己心中合格的程序員，也是看看自己的生活與思想的軌跡，以此記錄自己。畢竟隨著生命的流逝，突然發現生命已經過去了那麽多，而自己卻像這些逝去的生命不曾發生過一樣，什么痕跡都沒有留下。我覺得這個太可怕了。","path":"about/index.html","date":"09-29","excerpt":""},{"title":"categories","text":"","path":"categories/index.html","date":"10-02","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"09-25","excerpt":""},{"title":"tags","text":"","path":"tags/index.html","date":"10-02","excerpt":""}],"posts":[{"title":"斯大林排序是什麽","text":"__ 回答者：Yasutaka Ono, 学士 経済学, 東京都立大学 (2014) __ 《斯大林排序》是個什麽東西上個禮拜這個話題在Qiit上很火呢話説年輕時候的斯大林真是帥的一批啊！ 1.概要這是個把沒有被排序的元素刪除掉從而生成一個新的排序的排序算法。計算量感覺還可以吧。 2.實例例如存在下面這樣的列表 [1,2,1,1,4,3,9]進行斯大林排序之後就變成了下面這個樣子[1,2,4,9]如上，1，1，3被肅清了呢!把沒有遵從排序規則的數字直接清除掉，簡直就跟斯大林一樣！ 3.代碼kanaya老師用的是Haskel實現，在這裏我用python實現 12345678data = [1, 2, 1, 1, 4, 3, 9]purged_data = []tmp = data[0] -1for i,e in enumerate(data): if tmp &lt;= e: purged_data.append(e) tmp = eprint(purged_data) （下面是譯者自己的代碼實現） 12345678data = [1, 2, 1, 1, 4, 3, 9]purged_data = []purged_data.append(data[0]) for i in range(len(data)): if i &lt; len(data)-1: if data[i] &lt; data [i+1]: urged_data.append(data[i+1])print(purged_data)","path":"2020/03/10/これはテスト六/","date":"03-10","excerpt":"","tags":[{"name":"Quora","slug":"Quora","permalink":"https://babycarb.github.io/tags/Quora/"},{"name":"IT","slug":"IT","permalink":"https://babycarb.github.io/tags/IT/"},{"name":"算法","slug":"算法","permalink":"https://babycarb.github.io/tags/算法/"}]},{"title":"爲什麽日本的IT要比歐美國家的要差","text":"回答者：竜華 ジェイミー , FootyStats代表 / エンジェル投資家” 這個答案往細處追究我認為是沒有止境的。 基本上我覺得是因為我們的社會構造讓我們比較難去冒風險 我們的文化上就是覺得安穩的職業是比較理想的，比如說大公司的職員，公務員之類的。 因為#1的原因，創業會被認為是沒有什麼前途的 降低創業風險的風投並不是很多 因為創業企業比較少，大多數新的IT產品都是大公司在開發 然而，IT行業的新產品會對傳統行業產品的銷量造成威脅衝擊，這些大企業都不太想做創新的事情。 亦或者是根據現存的業務來製作產品，沒有什麼進步 與美國的IT公司的投資差距很明顯。跟矽谷的數十億日元的風投相比，日本僅僅只有數千萬日元 美國招募了世界各地的優秀人才，與之相比日本基本上只招募本國人才（世界人口的百分之二） 就算克服全部的難關創業了，比如一家公司做了SaaS軟體，他們是很難推廣到那些已經有現成系統使用的中小企業當中去的，雖然在美國這也不容易，但跟在日本比起來已經是容易太多了。 新興企業的產品跟大公司製作的產品相比較，人們的心中果然還是大公司的東西會更值得信賴，所以即便是大公司的東西品質要差也要用大公司的東西 因為以上所有的原因，國內（日本）IT產品的進化生態圈比較慢。日本程式員的技術也與歐美程式員出現差距。UX技術，設計技術，工程技術，schooling，不論是哪一個都是落後於矽谷的 也有跟風險沒有關係的理由 日本跟世界別的地方比起來，文化比較特殊，在日本被接受的IT產品，在世界其他地方卻屢屢推廣不動（メルカリ，Mixi等） 日本的消費者與世界其他地方的消費者比較是相對有富裕的，也具比較信任自己的東西。所以僅僅是日本本國市場就已經賺的夠多了，完全沒有必要發展海外業務。 越是在日本國內成功的IT產品，越是會專門走向日本製造的道路，漸漸也就不被世界其他地方所接受了。 因為#3的原因，越是在日本取得成功的IT產品，創業後的幾年進軍海外市場的時候都沒有什麼好下場（GREE，DeNA，メルカリ，其他） 日本的企業重在考慮自身組織，而矽谷的企業則主要把焦點集中在產品以及用戶身上 日本的面積比較小，又是單一民族的國家，IT企業基本沒有縮小技術的需要，真辣雞（例：僅僅日本用戶就足夠多的話，就在東京再加一個伺服器。但全世界都是服務對象的話，數據庫得對全世界都開放。設置Sharding，不同國家制定不同價格，或者根據國別道入特殊的支付系統，或者將資料庫的語言全球統一化……這些所有的縮放日本都不是很擅長，而且本來有經驗的人就少，自然經歷的機會也少了）（這個縮放技術，我是真的不知道應該怎麽翻譯了……所以就直接把單詞意思翻譯過來了） IT行業最新的技術與知識大都是英文的，對於日本人來說，這個確實挺難的。 歐美的資訊流通十分快，帶動的技術與技能的發展的速度也是很快的。對於國外的資訊不怎麼流通的日本國內來說，相對發展的很遲鈍 其他也有很多理由，但現在腦子裏提煉出來的暫時就這一些了 回答者：Myodo Yasuhiro, 株式会社エナ・ストーンの代表取締役（だいひょうとりしまりやく） (2016〜現在) 這個回答僅僅是一己私見，首先關於IT能解決什麽問題的誤會正在汎濫。IT是information technology的縮寫，意爲使用信息的技術，而且也誕生了ICT這個單詞，C是Communication的縮寫，這是加了一個通信而產生的新單詞。在日本大家卻認爲僅僅IT就能產生某些新的東西，因爲這樣的誤會，經常搞出一些不明所以的東西我認爲對諸如會計等可以有共通化的東西進行定制，這樣的行爲流程也是這樣的。明明只要作成決算書就好的，卻想用多餘的手段方法做多餘的東西。管理會計的規則又是不可以的，又想定制自己的規則……結果最終想做了一堆自己看都不想看的賬票。只有本業才有價值，IT便只是將這些聯係組合而已，認爲IT本身就能產生價值，這就是與歐美各國比起來這就是日本的IT弱的原因之一還有就是派遣勞動者的增多。組成日本IT主體的技術者，基本都是到客戶企業進行派遣作業的，大家都并不是爲了自己想做點什麽東西。因为这个原因日本的技术者往往都很难掌握高度的技术，而且與之相應的學術性要素也十分薄弱。这導致的結果便是，量产了那些逻辑不通的程序。日本的IT業是由外包與派遣構成主體的，與IT先進發達的欧美各国以及中国相比在先端競爭上就產生了差距最后，不論是操作系統還是集成開發環境日本都沒有國產貨，全部都是日化（對應漢化吧……不知道怎麽翻譯會更合適）版的歐美人不僅以母語為開發基礎，包含開發手法等都是使用自己文化下產生的東西，而日本僅是把他們的東西拿來日化一邊而且日化的產品還會存在翻譯錯誤，這怎麽想都是歐美人更占有優勢吧……","path":"2019/10/05/これはテスト5/","date":"10-05","excerpt":"","tags":[{"name":"日本","slug":"日本","permalink":"https://babycarb.github.io/tags/日本/"},{"name":"Quora","slug":"Quora","permalink":"https://babycarb.github.io/tags/Quora/"},{"name":"IT","slug":"IT","permalink":"https://babycarb.github.io/tags/IT/"},{"name":"文化","slug":"文化","permalink":"https://babycarb.github.io/tags/文化/"}]},{"title":"日本人爲何工作效率低下","text":"回答者：Rex Ray,日本在住 我是做IT的，有著大概三年日本公司工作的經驗，現在出差到日本，參加日本某家大公司的系統項目開發 以上是我的背景 我從在日本經歷的項目看來，我覺得并不是【日本人的生產性低】而是【日本的公司（比例不低）生產性低下】。 我在此舉幾個我經歷過的實例，出於保密的義務，我不會披露公司名以及人名 項目1這個項目是某大客戶的委托，爲了使商品能夠用iapd進行3D閲覽而開發APP的一個項目。APP很重要的一個功能是能夠根據客戶提供的參數列表動態地把商品的素材，外部環境等進行替換展示。因爲3D的環境構築已經有現成的框架了，活用字典以及循環的話，這個功能只需要數十行的代碼就可以實現了，但是當時負責這個事情的工作經驗十年以上的老手前輩活用的卻是複製黏貼，直接擼成了几千行的代碼。結果一般是三到四個人一個月搞定的事情，半年過去了都還是demo。最開始是預先六人月的樣子，但小組構成是四個人，所以晚了幾個月都還是只有demo的程度。這樣的事情發生與其説是誰的問題，倒不如説只能是公司作爲組織的生產性出人意料的低。 項目2這是最近的事情了。作爲系統協作的一環，我們讓協作項目組的N桑從他們那邊管理的Y系統導出數據。因爲是數據庫相關作業，僅僅是使用select命令將必要的數據通過CSV文件輸出的一個委托。・這邊收到的文件，擴展名雖然是CSV，但是實際内容卻是TSV・數據沒有文件頭，文件頭的那一行裏，命令還就那樣原封不動地保留在那裏・輸出的數據有一半以上是不需要的垃圾數據・逗號，制表符，換行等特殊符號也沒有進行轉義處理僅僅敲一行命令的事情，爲什麽過了兩個月到現在也沒有改善，我們明明都在郵件裏面把希望他們敲的命令整個都告訴他了…… 不是評價這件事情有關聯的某個部門的誰誰誰，作爲一個組織容忍生產性低的行爲，這甚至可以説是對工作本身的妨礙了。 綜上所述，我認爲生產性低下的人世界上到處都有的，只是因爲日本的公司會相對比較容忍生產性低下，日本的工資作爲一個組織助長了這種所謂生產性低下的行爲，難道不是嗎？","path":"2019/10/03/これでいいですか/","date":"10-03","excerpt":"","tags":[{"name":"日本","slug":"日本","permalink":"https://babycarb.github.io/tags/日本/"},{"name":"Quora","slug":"Quora","permalink":"https://babycarb.github.io/tags/Quora/"},{"name":"IT","slug":"IT","permalink":"https://babycarb.github.io/tags/IT/"}]},{"title":"東京登山紀實","text":"前些日子跟着前辈去爬山，说是东京秋天的红叶很好看，但是今年入秋似乎是比较晚的，要十一月末的时候，满山才能红起来，现在十一月初上山完全是没有叶子要红的迹象。往藤野去的车上，很多人都是身着登山的装备，年纪也是各个层次，年轻人到上了年纪的老人都有。一路上没有平时上班时候的拥挤跟嘈杂，其实通勤时候，在拥挤的车厢里，如果天气很好的时候，是可以很清楚的看见富士山的。到了藤野我也很是惊叹，在东京繁华美丽的背后居然有着如此恬淡清新的地方。没有闹市热闹并且略带肮脏的街头，取而代之的都是木制的日本民房，森林，小桥以及泉水。 (藤野站附近泉水) （藤野站附近小桥和民居） 当天我们翻了三座山，阵马山，景信山以及高尾山。上阵马山的时候，我完全没有一种上山的感觉，只感觉前辈带着走了一条泥泞小路之后便告诉我说开始上山了，随着就是在泥泞小路一路爬升。体力的透支让我有了总被抛弃到荒野的感觉。山里面基本看不见什么处处都是高耸的树木，脚下的路也几乎都没有人工加工的痕迹，我甚至觉得，上山所谓的路都是大家直接一脚一脚踩出来的。路上来爬山的人也是很多，大家都很有礼貌，凡是碰到了其它人大家基本都还是会大声招呼，问候一下。很多人，身着冲锋衣，带着两根登山杖，背着个大背包，有些人还会在包上挂一个小铃铛，走起路来叮叮当当的。走了一阵我确实感觉到登山杖的必要，有些路很难走，泥泞的阶梯几乎都是树根盘摞起来的，上到一半的时候，我光靠腿是已经不能再上山了，都是要靠攀着树枝前进。快到山顶的时候我的目标已经不是山顶了，而是向前走一步，就这样一个一个目标的累计，我终于到了阵马山顶。到了山顶的兴奋自是不可言喻，但我的兴奋不是来自山顶的美丽风光，也不是来自爬上去的成就感，单纯只是兴奋于这趟艰难的旅途终于结束了。 （阵马山的森林） 山顶并没有那种让我想象的那种感觉，怎么说呢，感觉过于原生态了吧！这一只白马塑像，加上的木制桌椅，有没有一个简陋的小卖部我是真的完全不记得了。对于当时的我来说，有没有小卖部都是无所谓的，重要的是要有桌椅。毕竟一下子摊在那种泥泞的地上还是很不好的。但还没有等我觉得自己喘气能喘顺来的时候，前辈就在催着我下山了，也是那一刻我才知道，我当天的旅途才走了六分之一…… （阵马山的山顶标识） （阵马山的山顶桌椅） 景信山的上山路比起阵马山似乎是好了太多太多，至少是不用攀着树根上山了。不知道是为什么，这一趟上上似乎特别有精力，完全不是之前要死要活才上山的感觉。路上夜间到很多四五岁的小孩子装备齐全，跟着自己的爸爸（应该是爸爸吧，哈哈哈）上山了。而且在路上我一直很好奇，很多日本人登这种山为什么会背那么大的一个包到底是干什么的，快到景信山顶的时候，谜底终于是揭晓了。距离景信山顶约有两三百米的时候，在我边上休息的两个人从包里掏出了锅碗跟公仔面，开始坐在在哪里煮面了。我感觉这像是一个特色吧，日本人会在山顶或者山顶附近，自己拿锅煮面吃，前辈说，中国人上山都是农家乐杀鸡，日本人就是上山吃面馆或者自己煮面。到了山顶煮面吃面的就更多了，甚至还有个荞麦面馆。 （景信山顶的荞麦面馆以及吃面的人们） 这里的山顶完全不同于阵马山，完全没有那种荒凉的感觉。不仅是因为人多了，而且植被也是多了很多，阵马山就有个地中海大叔的感觉，四下郁郁葱葱，唯独山顶就是光秃秃的。景信山就显得正常多了，山顶依然是树木环绕，而且景信山的视野也是特别好，当天可能是因为天气的原因，我没有见到富士山。据说景信山是富士山以及关东原野很好的观赏点（尽管上班的时候如果天气好一点，从车窗往外也能很清楚看见富士山）。 （景信山的山顶标识） 下山的时候我发现，原来不止山顶会有荞麦面馆，到了山腰也是有的，是不是很有古代的小酒家的感觉呢。让过往的行人，吃上一碗面，喝上一碗酒或一碗茶，恢复元气后继续朝着目的地前进。 （山腰上的荞麦面馆） 接下来的山可能是三座山最知名的一座，有着很厚重的历史底蕴，传说有很多的天狗在那里修行。比起之前的两座山更是有人文痕迹，石阶更多了，几乎不会有什么攀着树根上山的感觉了。而且去山顶的路上的标语也是很人性化的。比起前两座山这个实在是好爬太多了，因为如此这座山的游客相对也是最多的，不仅是日本人，还有很多的外国人。但比起前两座山这座山我个人觉得打卡是最难的了，因为人实在是太多了，想单独拍到山顶的那个标志实在是不容易。这算是我等了很久才拍到的人相对较少的时候。自然山顶山还是少不了荞麦面馆，但这个山顶还有个很有意思的地方，东京水道局在这里配备了一个水龙头供山顶山的人们使用。 （高尾山路上的标语） （高尾山的山顶标识） （高尾山顶的水龙头） 不同于阵马山那种森林，高尾山的森林有往下流的山泉，以及超级粗的参天大树。这里还是很有双峰尖的感觉的。流水与山林交汇，寺庙与大山相融，人文与自然很好的结合了在一起。完全没有那种现代事物与自然的冲突。山上的寺庙我不知道是拜佛的还是拜天狗的，庙里的道路上有很多天狗的雕塑，尽管我一直觉得那些雕塑的形象真的很像电视剧里面的雷震子。对于一直比较喜欢东方古建筑的我来说，能在这个庙里逛上一圈，实在是一个享受。（寺庙很有意思，文字难以描述，因此直接上图，多图预警！！！） （高尾山的参天大树） （高尾山的寺庙建筑） 拖着疲惫终于到了上下，车站附近迎接我们的依然是潺潺流水，恬静的日本小屋。尽管我跟前辈都是已经很饿了，我们急需要补充米饭跟肉类，但是上下依然全都是荞麦面馆…… （高尾山脚的泉水及民居） 走进一家面馆，风格也是完全跟东京市区的面馆完全不一样，很强烈的一种，老板自己开的小饭馆的感觉呢。吃完上车，这一趟行程也就算是结束了。路程到十二分之一的时候，我就觉得自己受不了了，很后悔，一直在问自己躺在家里往游戏机不好吗，为什么要这样折磨自己，到山顶都要蹲下一分钟左右来拉扯大腿肌肉以缓解抽筋的疼痛，下山也因为膝盖的疼痛，几乎不能走硬化的路面（所以高尾山的路修得那么好，对我来说真是一个巨大的挑战呢），但是一趟下来，心情是真的很好的。那些自己刚开始认为基本是遥遥无期，几乎是无法完成的事情，每一步都保持着踏出第一步的心情，一步一步不也是做下来了。总结登山虽好，身体更重要，注意带上登山杖跟护膝，山可以一步一步爬，膝盖伤了是永远的（膝盖可是休养了半个月才缓过来，都以为自己膝盖要废了呢……）。","path":"2019/10/03/これはテスト三/","date":"10-03","excerpt":"","tags":[{"name":"日本","slug":"日本","permalink":"https://babycarb.github.io/tags/日本/"},{"name":"文化","slug":"文化","permalink":"https://babycarb.github.io/tags/文化/"}]},{"title":"lambda表达式—foreach的使用","text":"使用lambada对list和map的遍历 lambada表达式遍历简洁方便，在此记录。 list的示例 1234567891011public void testUpdateUser()&#123; int id = 2; AyUser user = new AyUser(); user.setName(&quot;IornMan&quot;); user.setPassword(&quot;886688668866&quot;); int a = ayUserDao.updateUser(user, id); List&lt;AyUser&gt; userList = ayUserDao.findById(2); userList.forEach(x -&gt; System.out.println(x.getName() + x.getPassword())); &#125; map的示例 123456789public void testUpdateUser()&#123; Map&lt;String, String&gt; map = new HashMap&lt;String, String&gt;() &#123;&#123; put(&quot;key1&quot;, &quot;value1&quot;); put(&quot;key2&quot;, &quot;value2&quot;); put(&quot;key3&quot;, &quot;value3&quot;); &#125;&#125;; map.forEach((k,v)-&gt;System.out.println(&quot;Key:&quot; + k + &quot;-----Value:&quot; + v));&#125;","path":"2019/10/03/这是测试2/","date":"10-03","excerpt":"","tags":[{"name":"Java","slug":"Java","permalink":"https://babycarb.github.io/tags/Java/"}]},{"title":"這便是救贖之旅","text":"上出遼平（電視製作人） 在東京電視臺製作《振奮而又客觀的美食報告（ハイパーハードボイルドグルメリポート）》已經有三個年頭了。但我想大多數人應該都對這個節目名字沒有什麽印象。畢竟，這個節目只是時不時在深夜檔放送，并且沒有節目預告，所以大家接觸的機會可能沒有那麽多。可是實際上這個節目配有多種語言字幕并且在全世界範圍放送的，算得上是一個有點不同尋常的節目。正如節目的名稱，這是一個美食節目，但是這裏說的美食并不是僅僅指能放到嘴巴裏面吃的食物。比如説在非洲小國利比亞一邊沉浸于可卡因一邊互相殘殺的少年士兵的飯。比如説通過幹掉敵對組織好幾個人從而發家的台灣黑幫老大的飯。還有西伯利亞的邪教團、塞爾維亞即便是被禁足也要試圖跨過邊境的難民們以及土耳其的偷渡中介的飯。那些在日本絕對遇不到的人們，我一個人帶著攝像機對著他們說“你吃的飯能給我看一下嗎”，然後跟他們吃著一鍋的飯，用耳朵傾聽著他們説的話。在對他們來説平常的生活當中與他們共食，不知不覺中他們生活的不正常的世界與我們的正常的世界發生了轉換。請原諒我的唐突的自説自話，我覺得這不僅是這個節目的意義，亦是我自己的救贖之旅。難得有寫隨筆的機會，就不寫一些所謂高大上的東西了，而是想坦誠地將至今爲止一直沒能跟其他人開口的話寫出來。當然這一切都不是我最初就想著來一個自己的救贖之旅而開始的。只是在世界的盡頭與他們在同一張飯桌上面的時候，不知不覺中我就覺得自己被救贖了。曾經我也是個問題少年。我也有過同其他人相互爭吵，偷東西，單方面無視眼前一切規則束縛的時代。那時的我是一個不被他人所愛的存在。爲什麽自己要做那樣的事情呢？當時的我自己也理解不了。我自己認可不了自己，在我傷害別人的同時自己也受到了傷害，慢慢我也就成熟懂事了。但是即便是所謂重生了之後，那些膿一樣的東西依然一直存在于我心裏。然而，我在非洲的飯館意外看到了被治愈的徵兆。在利比亞我一個人跟一個妓女會面了。十幾年前她的家被火箭彈給摧毀了，雙親也在那場災難中犧牲。她自己當時還是一個十一歲的小女孩，也被拉到了前綫充兵。在那期間殺了多少人她也不知道。内戰結束后到現在她一直以站街賣春爲生，直到現在她已經二十八嵗了都還生活在沒有屋頂的墓地裏。我是在墓地裏見到她的。告訴她我想看看她的飯，她回答我説，只有工作之後她才會有錢。她接客的地方我也有在場。賣了一次春她到手的是兩百日元（十三塊RMB左右），花了一百五十日元吃了一頓飯吃，她徑直看著我的眼睛，告訴我她的夢想是成爲一個有錢人。我也徑直看著她的眼睛回答她，那真的是一個好夢想。那個時候我感覺自己心裏的那些膿一樣的東西滑落了出去。我不知道原因是什麽，我沒有絲毫為自己的過去正名的意思，我認同了生活在世界規則之外的她，那個瞬間爲什麽我也認可了過去的自己。我與世界的“罪人”一起吃飯。撥開他們表面上的污點，對深處的人性進行認可。我在認可他們的同時也認可了我自己。雖然不是去原諒罪孽本身，但是與曾經十分想被認可的我來説，在這一方面是重合的，我現在終於可以坦然接受了。儘管我覺得自己罪孽深重，但世界上沒有人可以不背負一點罪惡活下去。所以我想節目的觀衆們也與我一起得到了救贖與原諒。這是我不論肯定與否都耐著性子儘所能認可這個世界的全部的一個嘗試。我們沒有被其他人認可的話，是不能真正活下去的。（譯自文藝春秋2020年5月刊）","path":"2019/10/03/Untitled/","date":"10-03","excerpt":"","tags":[{"name":"文化","slug":"文化","permalink":"https://babycarb.github.io/tags/文化/"}]},{"title":"日本公共交通見聞","text":"對於單程通勤時間將近一個半小時的我而說，有個座位是多麼舒服的一件事情。畢竟在這種擁擠的環境站一個半小時，列車誤點就站兩個小時，說通勤累過上班一點都不為過。每天早上到新宿的時候，便是決定我上班累過通勤，還是通勤累過上班的時候了。前幾天也不例外，我發現右上角還有一個座位，與此同時，有一位女士也在向那個座位走去。慢一步就是繼續站四十分鐘，我的身體完全沒有經過我大腦的同意就沖向了那個座位。成功坐上座位後 ，我與那位女士相視了兩三秒。她便是有點無奈站到了車門旁邊靠著。這時候我對面有位男士，起來把自己的座位讓給了她，我才注意到她已是有孕在身了。霎時間我覺得自己是做了惡一般，雙腿都有點發軟了。(下圖東京山手綫電車通勤高峰的時候) 但仿佛是老天特意給我一個機會一樣，次日我上班又碰到了一個跟社畜們一起擠電車的孕婦，我這次是先坐到座位了的，但是還是毫不猶豫選擇站了一個半小時去上班。這也讓我的沉重的心情一下子明朗了太多太多。從這開始我搶座位的時候會注意了一些，因為是真的不注意看是看不出來是孕婦的。畢竟那種真的大得很明顯的，也不可能跟我們這些社畜一次擠電車了。也是以這個為契機讓我開始在使用日本公共交通的時候開始了對周圍人進行了些許觀察。 我來日本之前看過一部比較有意思的日劇，名爲《日本人不知道的日本語》。在那部電視劇的第一集，主人公春子與黑人小哥鮑勃在公交車上相遇。鮑勃沉浸在音樂中，戴著耳機，搖頭晃腦，面帶微笑，十分享受的模樣。此時鮑勃的邊上真是站著一位日本老太太，春子提醒鮑勃把自己的座位讓給老太太。鮑勃卻是很不在意的樣子，用英文告訴春子自己很累，説罷便又是戴上耳機，搖頭晃腦，面帶微笑，十分享受的模樣。春子很生氣，狠狠説了鮑勃一頓，告訴他這裏是日本，在日本給老人讓座是理所當然的事情。既然來了日本便是要入鄉隨俗才行的。全車的人此時毫不吝嗇地奉獻了自己的掌聲。(下圖春子與鮑勃) 很多日劇都有類似的劇情，所以來日本之前我一直都有著日本人很注重給老者讓座的印象。那時候我感覺不論中日，年輕人給年長者讓座似乎是特別正常的事情了。但很意外的是，來到日本之後發現在日本給老者讓座的行為並沒有我想像中的那樣頻繁，取而代之的現象是，日本會有更多的老者跟年輕人一起擠地鐵跟電車。在日本的老者也不會因為年輕人沒有給他讓座而產生任何的不好的情緒。每當我給年紀大的阿婆或者是阿公讓座的時候，他們都會大都會謙讓一下，然後會很真誠的跟你說聲謝謝，在他們下車的時候也會再次跟我道聲謝，比他們先下車的時候，他們也會跟我打聲招呼然後再次致謝。剛來日本的我，對於他們這種致謝實在是有些不適應。實在是過於禮貌了。並且我認為這個是理所當然的事情，他們沒有什麼必要致謝的。不過後來想想這也是正常的，畢竟讓一個過度加班勞累，每天單程通勤一兩個小時的年輕人給一個，身體健康，休息充足的六十歲老者讓座確實是有些不合常理了。 再有一個就是日本人相對來説比較喜歡在公共交通上看書，在日本會經常見到人們在電車或是地鉄拿著書再看。在東京的書店，口袋讀本十分受歡迎。大家在車上的書的題材也是多種多樣，有成功學，人生槼劃之類的書，也有專業書籍，有小説，也有漫畫。最讓我印象深刻的是看見一位老者在車上看純英文報紙。但是感覺現在在公共交通上看書的人越來越少了，因爲時代的推進，越來越多的人使用電子設備來消磨漫長的通勤時間。有人用亞馬遜電子書，看電子讀物，有人用新大三或是NS玩遊戲。但更多的人是使用智能手機，有用智能機聼音樂的，也有智能機跟朋友聊天的，有用智能機看電視看新聞的，也有玩推特跟消消樂的。手機的品牌也是比較多，日本的年輕人多用iPhone，年紀大的人多用索尼，但是現在在日本使用華爲的人也日漸增多了，地鐵口等各種地方都有華爲的廣告。日本的新聞也有報道，使用紙製新聞的人越來越少，劣化的媒體被淘汰了。(下圖日本電車的閲讀狀況) 還有一個現象我看著感覺很喜歡，日本電車上的小孩子，想窩在列車座椅上的時候會自己把鞋子脫下來，坐到車座位上。最多的時候便是看見爸爸坐在座位上，小孩子脫下鞋子趴在爸爸身上睡覺，感覺場面還是蠻溫馨的。 相對於世界上大多數的城市，東京的交通系統十分發達。列車（不論是地上跑的，還是地下跑的，還是空中軌道跑的）是這裏的人最主要的交通手段。但不是說，東京沒有其他的公共交通了。我在這裏的主要交通手段也是列車，但我也嘗試過一次日本的城巴。因爲只坐過一次，所以資訊並沒有什麽可靠性。這裏的城巴比中國的城巴小太多了，像廣州的那種幾節的那種城巴，不要説坐了，我在這裏連見都沒有見過。我那次坐城巴的時候，除了跟我同行的一位朋友之外，全車都是日本的老頭子老太太。我想這跟東京發達的鐵路系統有很大的關係吧，因爲去任何地方，坐列車基本都是夠了的。(下圖東京最常見的巴士) 總體上，我個人覺得日本在公共交通的行爲是讓人蠻舒服的，很少會感覺到周圍有人做出讓自己不舒服的行爲。即便是在擁擠的時候也不例外。當然像是那種在擠得腰得彎成三十度角的程度，然後有人放了個悶屁不能算。畢竟這種無法避免的事情是真的沒有辦法。儘管知道對方並不想那樣做，但不適感是真的難免的。還是得提醒自己下次真的要注意一下周圍是不是有孕婦之類不方便的人了，周圍尷尬不説，自己是真的覺得有些過不去。","path":"2019/09/22/home/","date":"09-22","excerpt":"","tags":[{"name":"日本","slug":"日本","permalink":"https://babycarb.github.io/tags/日本/"},{"name":"文化","slug":"文化","permalink":"https://babycarb.github.io/tags/文化/"}]}]}